Documents/КоммерческоеПредложение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КоммерческоеПредложение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьАвтоматизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбластиАвтоматизациии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НашиФирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыФирмы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НашиРеквизиты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПредложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтрокиПодвала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МакетПодвал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КоммерческоеПредложение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Печать(Команда)
	ТабДокумент = ПечатьНаСервере();
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.Показать("Коммерческое")
КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере()
	ТабДокумент = Документы.КоммерческоеПредложение.ПечатьКоммерческого(Объект.Ссылка);
	Возврат ТабДокумент; 
КонецФункции

#Область СобытияФормыДокумента

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ДобавитьСтандартныеСтрокиПодвалаНаСервере();
		
	КонецЕсли; 
	
	
КонецПроцедуры

#Область ОбработкаМакетаПодвала

&НаСервере
Процедура ДобавитьСтандартныеСтрокиПодвалаНаСервере()
	ДобавитьСтрокуВПодвал("ПодсчетыПредварительные");
	ДобавитьСтрокуВПодвал("ДополнительныеДоработкиЗаОтдельнуюПлату");
	ДобавитьСтрокуВПодвал("Актуальность3Дня");
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВПодвал(Примечание)
	НоваяСтрокаПодвал = Объект.СтрокиПодвала.Добавить();
	НоваяСтрокаПодвал.Примечание = Справочники.МакетПодвал[Примечание];
КонецПроцедуры

#КонецОбласти


#КонецОбласти


#Область СобытияТабличнойЧастиДокумента

// СОБЫТИЯ ПРИ ИЗМЕНЕНИИ
 //////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.ПереченьТоваров.ТекущиеДанные;
	ПересчитатьСумму(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.ПереченьТоваров.ТекущиеДанные;
	ПересчитатьСумму(ТекДанные);
КонецПроцедуры

//////////////////////////////////////////////////////////////////


&НаКлиенте
Процедура ПересчитатьСумму(ТекДанные)
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
КонецПроцедуры

#КонецОбласти
